Управление_квизами_финал/src/InformationRegisters/НастройкиКвиза/НастройкиКвиза.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиКвиза</name>
  <resources>
    <name>ЭталонныйОтвет</name>
    <type>
      <types>DefinedType.Ответ</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоБаллов</name>
    <type>
      <types>DefinedType.КоличествоБаллов</types>
    </type>
  </resources>
  <dimensions>
    <name>Квиз</name>
    <type>
      <types>DefinedType.Квиз</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Команда</name>
    <type>
      <types>CatalogRef.Команды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Раунд</name>
    <type>
      <types>DefinedType.Раунд</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вопрос</name>
    <type>
      <types>CatalogRef.Вопросы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_квизами_финал/src/InformationRegisters/АктивныеРаунды/АктивныеРаунды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АктивныеРаунды</name>
  <dimensions>
    <name>Квиз</name>
    <type>
      <types>DefinedType.Квиз</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Раунд</name>
    <type>
      <types>DefinedType.Раунд</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_квизами_финал/src/InformationRegisters/ОтветыКоманд/ОтветыКоманд.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтветыКоманд</name>
  <resources>
    <name>Ответ</name>
    <type>
      <types>DefinedType.Ответ</types>
    </type>
  </resources>
  <resources>
    <name>ОтветПринят</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоБаллов</name>
    <type>
      <types>DefinedType.КоличествоБаллов</types>
    </type>
  </resources>
  <dimensions>
    <name>Квиз</name>
    <type>
      <types>DefinedType.Квиз</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Команда</name>
    <type>
      <types>CatalogRef.Команды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Раунд</name>
    <type>
      <types>DefinedType.Раунд</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вопрос</name>
    <type>
      <types>CatalogRef.Вопросы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_квизами_финал/src/CommonModules/УправлениеКвизами/Module.bsl
#Область ПрограммныйИнтерфейс

// Создание нового квиза на основе данных описания
//
// Параметры:
//  ОписаниеКвиза см. НовоеОписаниеКвиза
//
Процедура НовыйКвиз(ОписаниеКвиза) Экспорт
	
	РегистрыСведений.НастройкиКвиза.НовыйКвиз(ОписаниеКвиза);
	
КонецПроцедуры

Функция НастройкиКвиза(Квиз) Экспорт
	
	Возврат РегистрыСведений.НастройкиКвиза.НастройкиКвиза(Квиз);
	
КонецФункции

Функция КомандаКапитана(Квиз) Экспорт
	
	Возврат РегистрыСведений.НастройкиКвиза.КомандаКапитана(Квиз);
	
КонецФункции

Функция ВопросыКвиза(Квиз) Экспорт
	
	Возврат РегистрыСведений.НастройкиКвиза.ВопросыКвиза(Квиз);
	
КонецФункции

Процедура АктивироватьРаунд(Квиз, Раунд) Экспорт
	
	РегистрыСведений.АктивныеРаунды.АктивироватьРаунд(Квиз, Раунд);
	
КонецПроцедуры

Функция АктивныйРаунд(Квиз) Экспорт
	
	Возврат РегистрыСведений.АктивныеРаунды.АктивныйРаундКвиза(Квиз);
	
КонецФункции

Функция ИнформацияПоРаундамКвиза(Квиз) Экспорт
	
	Возврат РегистрыСведений.АктивныеРаунды.ИнформацияПоРаундамКвиза(Квиз);
	
КонецФункции

Функция ОтветБылОтправленКомандой(ОписаниеОтвета) Экспорт
	
	Возврат РегистрыСведений.ОтветыКоманд.ОтветБылОтправленКомандой(ОписаниеОтвета);
	
КонецФункции

//Параметры:
//   ОтветыКоманды - см. НовоеОписаниеОтвета
Процедура ЗафиксироватьОтвет(ОписаниеОтвета, ОтветПринят) Экспорт
	
	Если ОтветПринят Тогда
		РегистрыСведений.ОтветыКоманд.ПринятьОтвет(ОписаниеОтвета);
	Иначе
		РегистрыСведений.ОтветыКоманд.ОтозватьОтвет(ОписаниеОтвета);
	КонецЕсли;
	
КонецПроцедуры

//Параметры:
//   ОтветыКоманды - см. НовоеОписаниеОтветовКоманды
Процедура ЗафиксироватьОтветыРаунда(ОтветыКоманды) Экспорт
	
	РегистрыСведений.ОтветыКоманд.ЗафиксироватьОтветыРаунда(ОтветыКоманды);
	
КонецПроцедуры

Процедура ЗавершитьКвиз(Квиз) Экспорт
	
	РегистрыСведений.АктивныеРаунды.ЗавершитьКвиз(Квиз);
	
КонецПроцедуры

Функция ИнформацияОВопросе(Вопрос) Экспорт
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Вопрос, "Ответ, КоличествоБаллов");
	
КонецФункции

//Возвращает структуру для удобства создания нового квиза
//
// Возвращаемое значение:
//   Структура
//   * Квиз - ОпределяемыйТип.Квиз
//   * ВопросыРаундов - Массив - значения в виде структуры, см. НовоеОписаниеВопросаРаунда
//   * Команды - Массив - значения в виде структуры, см. НовоеОписаниеКоманды
//
Функция НовоеОписаниеКвиза() Экспорт
	
	Описание = Новый Структура;
	Описание.Вставить("Квиз");
	Описание.Вставить("ВопросыРаундов", Новый Массив);
	Описание.Вставить("Команды", Новый Массив);
	
	Возврат Описание;
	
КонецФункции

//Возвращает структуру для удобства создания нового вопроса для наполнения раундов
//
// Возвращаемое значение:
//   Структура
//   * Раунд - ОпределяемыйТип.Раунд
//   * Вопрос - СправочникСсылка.Вопросы
//   * ЭталонныйОтвет - ОпределяемыйТип.Ответ
//   * КоличествоБаллов - Число - баллы за правильный ответ
//
Функция НовоеОписаниеВопросаРаунда() Экспорт

	Описание = Новый Структура;
	Описание.Вставить("Раунд");
	Описание.Вставить("Вопрос");
	Описание.Вставить("ЭталонныйОтвет");
	Описание.Вставить("КоличествоБаллов");
	
	Возврат Описание;
	
КонецФункции

//Возвращает структуру для удобства наполнения команд для нового квиза
//
// Возвращаемое значение:
//   Структура
//   * Команда - СправочникСсылка.Команды
//
Функция НовоеОписаниеКоманды() Экспорт
	
	Описание = Новый Структура;
	Описание.Вставить("Команда");
	
	Возврат Описание;
	
КонецФункции

Функция НовоеОписаниеОтветовКоманды() Экспорт

Описание = Новый ТаблицаЗначений;
Описание.Колонки.Добавить("Квиз", Новый ОписаниеТипов("СправочникСсылка.Квизы"));
Описание.Колонки.Добавить("Команда", Новый ОписаниеТипов("СправочникСсылка.Команды"));
Описание.Колонки.Добавить("Раунд", Новый ОписаниеТипов("СправочникСсылка.Раунды"));
Описание.Колонки.Добавить("Вопрос", Новый ОписаниеТипов("СправочникСсылка.Вопросы"));

Типы = УправлениеКвизамиПовтИсп.ДоступныеФорматыОтвета();
Описание.Колонки.Добавить("Ответ", Новый ОписаниеТипов(Типы));

Возврат Описание;

КонецФункции

Функция ИнформацияПоОтветамИерархически(Квиз) Экспорт
	
	Возврат РегистрыСведений.ОтветыКоманд.ИнформацияПоОтветамИерархически(Квиз);
	
КонецФункции

#КонецОбласти
